schreibfaul1/ESP32-audioI2S/src/Audio.h
  private:
    enum : int { APLL_AUTO = -1, APLL_ENABLE = 1, APLL_DISABLE = 0 };
    enum : int { EXTERNAL_I2S = 0, INTERNAL_DAC = 1, INTERNAL_PDM = 2 };
    enum : int { FORMAT_NONE = 0, FORMAT_M3U = 1, FORMAT_PLS = 2, FORMAT_ASX = 3, FORMAT_M3U8 = 4 }; // playlist formats
    const char* plsFmtStr[5] = {"NONE", "M3U", "PLS", "ASX", "M3U8"};                                // playlist format string
    enum : int { AUDIO_NONE, HTTP_RESPONSE_HEADER, HTTP_RANGE_HEADER, AUDIO_DATA, AUDIO_LOCALFILE, AUDIO_PLAYLISTINIT, AUDIO_PLAYLISTHEADER, AUDIO_PLAYLISTDATA };
    const char* dataModeStr[8] = {"AUDIO_NONE", "HTTP_RESPONSE_HEADER", "HTTP_RANGE_HEADER", "AUDIO_DATA", "AUDIO_LOCALFILE", "AUDIO_PLAYLISTINIT", "AUDIO_PLAYLISTHEADER", "AUDIO_PLAYLISTDATA"};
    enum : int { FLAC_BEGIN = 0, FLAC_MAGIC = 1, FLAC_MBH = 2, FLAC_SINFO = 3, FLAC_PADDING = 4, FLAC_APP = 5, FLAC_SEEK = 6, FLAC_VORBIS = 7, FLAC_CUESHEET = 8, FLAC_PICTURE = 9, FLAC_OKAY = 100 };
    enum : int { MP3_BEGIN = 0, MP3_ID3HEADER, MP3_NEXTID3, MP3_EXTHEADER, MP3_ID3FRAME, MP3_FRAMESIZE, MP3_SKIP, MP3_TAG, MP3_SYLT, MP3_ID3V22, MP3_LASTFRAMES, MP3_XING, MP3_OKAY = 100 };
    enum : int {
        M4A_BEGIN = 0,
        M4A_FTYP = 1,
        M4A_CHK = 2,
        M4A_MOOV = 3,
        M4A_FREE = 4,
        M4A_TRAK = 5,
        M4A_MDAT = 6,
        M4A_ILST = 7,
        M4A_MP4A = 8,
        M4A_ESDS = 9,
        M4A_MDIA = 10,
        M4A_MINF = 11,
        M4A_STBL = 12,
        M4A_STSD = 13,
        M4A_UDTA = 14,
        M4A_STSZ = 15,
        M4A_META = 16,
        M4A_MDHD = 17,
        M4A_CHPL = 18,
        M4A_AMRDY = 99,
        M4A_OKAY = 100,
    };
    enum : int { CODEC_NONE = 0, CODEC_WAV = 1, CODEC_MP3 = 2, CODEC_AAC = 3, CODEC_M4A = 4, CODEC_FLAC = 5, CODEC_OPUS = 6, CODEC_VORBIS = 7, CODEC_OGG = 8 };
    const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "OPUS", "VORBIS", "OGG"};
    enum : int { ST_NONE = 0, ST_WEBFILE = 1, ST_WEBSTREAM = 2 };
    const char* streamTypeStr[3] = {"NONE", "WEBFILE", "WEBSTREAM"};
    typedef enum { LEFTCHANNEL = 0, RIGHTCHANNEL = 1 } SampleIndex;
    typedef enum { LOWSHELF = 0, PEAKINGEQ = 1, HIFGSHELF = 2 } FilterType;

  private:
    typedef struct _filter {
        float a0;
        float a1;
        float a2;
        float b1;
        float b2;
    } filter_t;

    typedef struct _pis_array {
        int number;
        int pids[4];
    } pid_array;

  public:
    struct audioSettings {
        uint16_t DMA_DESC_NUM = 32;        // number of I2S DMA buffer
        uint16_t DMA_FRAME_NUM = 256;      // number of frames in one DMA buffer
        uint16_t FREQ_LS_HZ = 500;         // IIR Filter, lowshelf
        uint16_t FREQ_PEAK_HZ = 1800;      // IIR Filter, peakingEQ
        uint16_t FREQ_HS_HZ = 6000;        // IIR Filter, highshelf
        float    QUALITY_SLOPE = 0.707;    // Quality (all shelfes)
        uint16_t PEAK_HOLD_SAMPLES = 2000; // VU_meter, (2000) ca. 20 ms @ 48 kHz
        uint8_t  PEAK_RELEASE = 1;         // VU_meter, Fall rate
        bool     VU_LEVEL = true;          // true: vu meter is enabled
        bool     IIR_FILTER = true;        // true: IIR filter (highshelf, bandpass, lowshelf) are enabled
        bool     SPECTRUM = false;         // true: spectrum analyzer is enabled
    } settings;

  private:
    File                m_audiofile;
    NetworkClient       client;
    NetworkClientSecure clientsecure;
    NetworkClient*      m_client = nullptr;

    SemaphoreHandle_t mutex_playAudioData;
    SemaphoreHandle_t mutex_audioTask;
    SemaphoreHandle_t mutex_audioTaskIsDecoding;
    TaskHandle_t      m_audioTaskHandle = nullptr;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"

    i2s_chan_handle_t m_i2s_tx_handle = {};
    i2s_chan_config_t m_i2s_chan_cfg = {}; // stores I2S channel values
    i2s_std_config_t  m_i2s_std_cfg = {};  // stores I2S driver values

#pragma GCC diagnostic pop

    std::vector<ps_ptr<char>> m_playlistContent; // m3u8 playlist buffer from responseHeader
    std::vector<ps_ptr<char>> m_playlistURL;     // m3u8 streamURLs buffer
    std::deque<ps_ptr<char>>  m_linesWithURL;    // extract from m_playlistContent, contains URL and MediaSequenceNumber
    std::vector<ps_ptr<char>> m_linesWithEXTINF; // extract from m_playlistContent, contains length and metadata
    std::vector<ps_ptr<char>> m_syltLines;       // SYLT line table
    std::vector<uint32_t>     m_syltTimeStamp;   // SYLT time table
    std::vector<uint32_t>     m_hashQueue;

    static const uint8_t m_tsPacketSize = 188;
    static const uint8_t m_tsHeaderSize = 4;

    std::unique_ptr<Decoder> m_decoder = {};
    ps_ptr<int32_t>          m_outBuff;         // Interleaved L/R
    ps_ptr<int32_t>          m_resamplesBuff;   // Interleaved L/R
    ps_ptr<char>             m_metadataBuff;    // icy-metadata max (16 * 256 + 1) bytes
    ps_ptr<char>             m_httpRespHdrBuff; // store http response header
    ps_ptr<char>             m_ibuff;           // used in log_info()
    ps_ptr<char>             m_lastHost;        // Store the last URL to a webstream
    ps_ptr<char>             m_currentHost;     // can be changed by redirection or playlist
    ps_ptr<char>             m_lastM3U8host;
    ps_ptr<char>             m_speechtxt;   // stores tts text
    ps_ptr<char>             m_streamTitle; // stores the last StreamTitle
    ps_ptr<char>             m_streamURL;   // stores the last StreamURL
    ps_ptr<char>             m_playlistBuff;
    VolumeCurveFn            m_volumeCurve = nullptr;

    const uint16_t m_plsBuffEntryLen = 256;         // length of each entry in playlistBuff
    int            m_LFcount = 0;                   // Detection of end of header
    uint32_t       m_avr_bitrate = 0;               // average bitrate, median calculated by VBR
    uint32_t       m_nominal_bitrate = 0;           // given br from header
    uint32_t       m_audioFilePosition = 0;         // current position, counts every readed byte
    uint32_t       m_audioDataReadPtr = 0;          // used in playAudioData
    uint32_t       m_audioFileSize = 0;             // local and web files
    int            m_readbytes = 0;                 // bytes read
    uint32_t       m_metacount = 0;                 // counts down bytes between metadata
    int            m_controlCounter = 0;            // Status within readID3data() and readWaveHeader()
    int32_t        m_inputHistory[6] = {0};         // used in resampleI2Soutput()
    uint8_t        m_timeoutCounter = 0;            // timeout counter
    uint8_t        m_bitsPerSample = 16;            // bitsPerSample
    uint8_t        m_channels = 2;                  //
    uint8_t        m_playlistFormat = 0;            // M3U, PLS, ASX
    uint8_t        m_codec = CODEC_NONE;            //
    uint8_t        m_m3u8Codec = CODEC_AAC;         // codec of m3u8 stream
    uint8_t        m_expectedCodec = CODEC_NONE;    // set in connecttohost (e.g. http://url.mp3 -> CODEC_MP3)
    uint8_t        m_expectedPlsFmt = FORMAT_NONE;  // set in connecttohost (e.g. streaming01.m3u) -> FORMAT_M3U)
    uint8_t        m_streamType = ST_NONE;          //
    uint8_t        m_ID3Size = 0;                   // lengt of ID3frame - ID3header
    uint8_t        m_audioTaskCoreId = 0;           //
    uint8_t        m_M4A_objectType = 0;            // set in read_M4A_Header
    uint8_t        m_M4A_chConfig = 0;              // set in read_M4A_Header
    uint16_t       m_M4A_sampleRate = 0;            // set in read_M4A_Header
    int16_t        m_validSamples = 0;              //
    int16_t        m_curSample = 0;                 //
    uint16_t       m_dataMode = 0;                  // Statemaschine
    uint16_t       m_streamTitleHash = 0;           // remember streamtitle, ignore multiple occurence in metadata
    uint16_t       m_timeout_ms = 250;              //
    uint16_t       m_timeout_ms_ssl = 2700;         //
    uint32_t       m_metaint = 0;                   // Number of databytes between metadata
    uint32_t       m_chunkcount = 0;                // Counter for chunked transfer
    uint32_t       m_t0 = 0;                        // store millis(), is needed for a small delay
    uint32_t       m_bytesNotConsumed = 0;          // pictures or something else that comes with the stream
    uint64_t       m_lastGranulePosition = 0;       // necessary to calculate the duration in OPUS and VORBIS
    int32_t        m_resumeFilePos = -1;            // the return value from stopSong(), (-1) is idle
    int32_t        m_fileStartTime = -1;            // may be set in connecttoFS()
    uint16_t       m_m3u8_targetDuration = 10;      //
    uint32_t       m_stsz_numEntries = 0;           // num of entries inside stsz atom (uint32_t)
    uint32_t       m_stsz_position = 0;             // pos of stsz atom within file
    uint32_t       m_haveNewFilePos = 0;            // user changed the file position
    bool           m_f_alt_user_agent = false;      // use default or alternative user agent
    bool           m_f_I2S_init = false;            //
    bool           m_f_unsync = false;              // set within ID3 tag but not used
    bool           m_f_exthdr = false;              // ID3 extended header
    bool           m_f_ssl = false;                 //
    bool           m_f_running = false;             //
    bool           m_f_firstCall = false;           // InitSequence for processWebstream and processLokalFile
    bool           m_f_firstLoop = false;           // InitSequence in loop()
    bool           m_f_firstPlayCall = false;       // InitSequence for playAudioData
    bool           m_f_ID3v1TagFound = false;       // ID3v1 tag found
    bool           m_f_chunked = false;             // Station provides chunked transfer
    bool           m_f_firstmetabyte = false;       // True if first metabyte (counter)
    bool           m_f_playing = false;             // valid mp3 stream recognized
    bool           m_f_tts = false;                 // text to speech
    bool           m_f_ogg = false;                 // OGG stream
    bool           m_f_forceMono = false;           // if true stereo -> mono
    bool           m_f_rtsp = false;                // set if RTSP is used (m3u8 stream)
    bool           m_f_m3u8data = false;            // used in processM3U8entries
    bool           m_f_continue = false;            // next m3u8 chunk is available
    bool           m_f_ts = true;                   // transport stream
    bool           m_f_m4aID3dataAreRead = false;   // has the m4a-ID3data already been read?
    bool           m_f_psramFound = false;          // set in constructor, result of psramInit()
    bool           m_f_timeout = false;             //
    bool           m_f_audioTaskIsRunning = false;  //
    bool           m_f_allDataReceived = false;     //
    bool           m_f_stream = false;              // stream ready for output?
    bool           m_f_decode_ready = false;        // if true data for decode are ready
    bool           m_f_eof = false;                 // end of file
    bool           m_f_lockInBuffer = false;        // lock inBuffer for manipulation
    bool           m_f_audioTaskIsDecoding = false; //
    bool           m_f_acceptRanges = false;        //
    bool           m_f_reset_m3u8Codec = true;      // reset codec for m3u8 stream
    bool           m_f_connectionClose = false;     // set in parseHttpResponseHeader
    bool           m_f_i2s_channel_enabled = false; // true if enabled
    uint32_t       m_audioFileDuration = 0;         // seconds
    uint32_t       m_audioCurrentTime = 0;          // seconds
    uint32_t       m_audioDataStart = 0;            // in bytes
    OutputSR_t     m_output_sr = SR_ORIGIN;         // output samplerate
    size_t         m_audioDataSize = 0;             //
    size_t         m_ibuffSize = 0;                 // log buffer size for audio_info()
    size_t         m_i2s_bytesWritten = 0;          // set in i2s_write() but not used

    pid_array m_pidsOfPMT;
    int16_t   m_pidOfAAC;
    uint8_t   m_packetBuff[m_tsPacketSize];
    int16_t   m_pesDataLength = 0;

    // audiolib structs
    audiolib::ID3Hdr_t     m_ID3Hdr;
    audiolib::pwsHLS_t     m_pwsHLS;
    audiolib::pplM3u8_t    m_pplM3U8;
    audiolib::m4aHdr_t     m_m4aHdr;
    audiolib::plCh_t       m_plCh;
    audiolib::lVar_t       m_lVar;
    audiolib::prlf_t       m_prlf;
    audiolib::cat_t        m_cat;
    audiolib::ifCh_t       m_ifCh;
    audiolib::tspp_t       m_tspp;
    audiolib::pwst_t       m_pwst;
    audiolib::gchs_t       m_gchs;
    audiolib::pwf_t        m_pwf;
    audiolib::pad_t        m_pad;
    audiolib::sbyt_t       m_sbyt;
    audiolib::rmet_t       m_rmet;
    audiolib::pwsts_t      m_pwsst;
    audiolib::rwh_t        m_rwh;
    audiolib::rflh_t       m_rflh;
    audiolib::phreh_t      m_phreh;
    audiolib::phrah_t      m_phrah;
    audiolib::sdet_t       m_sdet;
    audiolib::fnsy_t       m_fnsy;
    audiolib::audioItems_t m_audio_items;
    audiolib::vu_items_t   m_vu_items;
    audiolib::fft_items_t  m_fft_items;
    audiolib::i2s_items_t  m_i2s_items;
    audiolib::resampler_t  m_resampler;
    audiolib::info_queue_t m_info_queue;
    audiolib::icy_items_t  m_icy_items;

    // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
  public:
    template <typename... Args> static bool info(Audio& instance, event_t e, const char* fmt, Args&&... args) {
        std::lock_guard<std::mutex> lock(instance.mutex_info);
        if (!fmt) return false;
        if (!audio_info_callback) return false;

        ps_ptr<char> result;
        result.assignf(fmt, std::forward<Args>(args)...);
        if (!result.get()) return false;

        auto extract_last_number = [](std::string_view s) -> std::optional<int32_t> {
            auto is_space = [](char c) { return std::isspace(static_cast<unsigned char>(c)); };
            auto is_digit = [](char c) { return std::isdigit(static_cast<unsigned char>(c)); };

            auto it = s.end();
            // skip trailing whitespace
            while (it != s.begin() && is_space(*(it - 1))) { --it; }
            auto end = it;
            // Reading numbers backwards
            while (it != s.begin() && is_digit(*(it - 1))) { --it; }
            // optional sign
            if (it != s.begin()) {
                char c = *(it - 1);
                if (c == '+' || c == '-') { --it; }
            }

